print('Задача 1. Тестовое задание')

# Степан пришёл устраиваться на работу, где ему дали тестовое задание:
# проанализировать такую таблицу,
# понять как она строится и написать программу для вывода её на экран.

# 0 2 4 6  8  10
# 1 3 5 7  9  11
# 2 4 6 8  10 12
# 3 5 7 9  11 13
# 4 6 8 10 12 14
# 5 7 9 11 13 15
#
# Помогите Степану реализовать такую программу.
# Подсказка: номера столбцов. А ещё не забудьте про литерал \t для табуляции

#-----------------------------------------------------------------------
# Для решения данной задачи можно воспользоваться двумерным списком.
# Заполняем таблицу элементами, которые соответствуют индексу строки плюс индексу столбца, умноженным на 2


# Создаем двумерный список размером 6x6
table = [[0] * 6 for _ in range(6)]

# Заполняем каждый элемент таблицы
for i in range(6):
    for j in range(6):
        table[i][j] = i + j * 2

# Выводим таблицу на экран
for row in table:
    for item in row:
        print(item, end='\t')
    print()
